export default function Doaa() {
  return (
    <div className="my-10 py-10 px-[15px] bg-green-header border-[2px] border-gray-600 shadow-box-shadow text-center text-white font-cairo">
      <h2 className="border-b-[2px] border-white w-fit mx-auto mb-5">
        <q>أدعو لمن فقدناهم</q>
      </h2>
      <p className="leading-[2.4] text-lg">
        اللهم اغفر لهم وارحمهم، وعافهم واعف عنهم، وأكرم نزلهم، ووسع مدخلهم،
        واغسلهم بالماء والثلج والبرد، ونقهم من الخطايا كما ينقى الثوب الأبيض من
        الدنس، وأبدلهم دارا خيرا من دارهم، وأهلا خيرا من أهلهم، وزوجا خيرا من
        زوجه، وأدخلهم الجنة، وأعذهم من عذاب القبر، ومن عذاب النار" "اللهم إنهم
        في ذمتك، وحبل جوارك، فقهم من فتنة القبر وعذاب النار، وأنت أهل الوفاء
        والحق، اللهم اغفر لهم وارحمهم، إنك أنت الغفور الرحيم" "اللهم اغفر
        لأحيائنا، وأمواتنا، وذكراننا، وإناثنا، وصغيرنا، وكبيرنا، ومن أحييته منا
        فأحيه على الإيمان، ومن توفيته منا فتوفه على الإسلام
      </p>
    </div>
  );
}
